#Область Интерфейс	

// Инициализация базовых параметров
//
Процедура Инициализировать() Экспорт

	 Тело = Новый Соответствие;

КонецПроцедуры // Инициализировать()


// Добавить тип ошибки
// 
// Параметры:
// 	ТипОшибки - Строка - тип возникшего исключения
// Возвращаемое значение:
// 	ОбработкаОбъект.ИсключениеSentry - сама обработка
Функция ТипОшибки(ТипОшибки) Экспорт

	Тело.Вставить("type", ТипОшибки);
	
	Возврат ЭтотОбъект;
	
КонецФункции 


// Добавить сообщение ошибки
// 
// Параметры:
// 	Сообщение - Строка - описание ошибки
// Возвращаемое значение:
// 	ОбработкаОбъект.ИсключениеSentry - сама обработка
Функция СообщениеОшибки(Сообщение) Экспорт

	Тело.Вставить("value", Сообщение);
	
	Возврат ЭтотОбъект;
	
КонецФункции


// Добавить имя модуля
// 
// Параметры:
// 	ИмяМодуля - Строка - имя модуля, в котором возникла ошибка
// Возвращаемое значение:
// 	ОбработкаОбъект.ИсключениеSentry - сама обработка
Функция Модуль(ИмяМодуля) Экспорт

	Тело.Вставить("module", ИмяМодуля);

	Возврат ЭтотОбъект;
	
КонецФункции

#Область Множественный_выбор

Функция Трассировка(ЭлементТрассировки) Экспорт

	Если Тело["stacktrace"] = Неопределено Тогда
		
		Тело.Вставить("stacktrace", Новый Соответствие);
		
	КонецЕсли;
	
	Если Тело["stacktrace"]["frames"] = Неопределено Тогда
		
		Тело["stacktrace"].Вставить("frames", Новый Массив);
		
	КонецЕсли;
	
	Тело["stacktrace"]["frames"].Добавить(ЭлементТрассировки.ПолучитьОписание());
	
	Возврат ЭтотОбъект;
	
КонецФункции

#КонецОбласти 

#КонецОбласти

#Область Терминальные_операции

Функция ПолучитьОписание() Экспорт
	
	Возврат Тело;
	
КонецФункции

#КонецОбласти