#Область Интерфейс	

// Инициализация базовых параметров
//
//
Процедура Инициализировать() Экспорт

    Тело = Новый Соответствие;

КонецПроцедуры // Инициализировать()

Функция ИдентификаторПользователя(ЗНАЧ id) Экспорт
	
	Тело.Вставить("id", ID);
	
	Возврат ЭтотОбъект;
	
КонецФункции

Функция АдресПочты(ЗНАЧ email) Экспорт
	
	Тело.Вставить("email", email);
	
	Возврат ЭтотОбъект;
	
КонецФункции

Функция Имя(ЗНАЧ ИмяПользователья) Экспорт
	
	Тело.Вставить("username", ИмяПользователья);
	
	Возврат ЭтотОбъект;
	
КонецФункции

Функция IP(ЗНАЧ IP) Экспорт
	
	Тело.Вставить("ip_address", IP);
	
	Возврат ЭтотОбъект;
	
КонецФункции

Функция ДополнительныйПараметр(ЗНАЧ ИмяПараметра, ЗначениеПараметра) Экспорт
	
	Тело.Вставить(ИмяПараметра, ЗначениеПараметра);
	
	Возврат ЭтотОбъект;
	
КонецФункции

#КонецОбласти

#Область Терминальные_операции

Функция ПолучитьОписание() Экспорт

	Возврат Тело;
	
КонецФункции

#КонецОбласти
