#Область Интерфейс	

// Инициализация базовых параметров
//
//
Процедура Инициализировать() Экспорт

    Тело = Новый Соответствие;

КонецПроцедуры // Инициализировать()

Функция ВремяВозникновения(МоментВремени) Экспорт
	
	Тело.Вставить("timestamp", ДатуВTimestamp(МоментВремени));
	
	Возврат ЭтотОбъект;
	
КонецФункции

Функция УказатьТип(ТипСобытия) Экспорт
	
	Тело.Вставить("type", ТипСобытия);
	
	Возврат ЭтотОбъект;
	
КонецФункции

Функция Уровень(ЗНАЧ Уровень) Экспорт
	
	Тело.Вставить("level", Уровень);
	
	Возврат ЭтотОбъект;
	
КонецФункции

Функция Категория(ЗНАЧ КатегорияСобытия) Экспорт

	Тело.Вствить("category", КатегорияСобытия);

	Возврат ЭтотОбъект;
	
КонецФункции

Функция Сообщение(ЗНАЧ ТекстСообщения) Экспорт
	
	Тело.Вставить("message", ТекстСообщения);
	
	Возврат ЭтотОбъект;
	
КонецФункции

Функция ДобавитьДанные(Ключ, Значение) Экспорт
	
	Если Тело["data"] = Неопределено Тогда
		
		Тело.Вставить("data", Новый Соответствие);
		
	КонецЕсли;
	
	Тело["data"].Вставить(Ключ, Значение);
	
	Возврат ЭтотОбъект;
	
КонецФункции

#Область Интерфейсные_операции

Функция Нажатие(ЗНАЧ ИмяЭлемента) Экспорт
	
	Возврат УказатьТип("ui").Категория("ui.click").Сообщение(ИмяЭлемента);
	
КонецФункции 

Функция Ввод(ЗНАЧ ИмяЭлемента) Экспорт
	
	Возврат УказатьТип("ui").Категория("ui.input").Сообщение(ИмяЭлемента);
	
КонецФункции

Функция Диалог(ЗНАЧ ТекстДиалога) Экспорт
	
	Возврат УказатьТип("ui").Категория("ui.dialog").Сообщение(ТекстДиалога);
	
КонецФункции

#КонецОбласти

#Область Прочие

Функция Лог(ЗНАЧ УровеньЛога, ЗНАЧ СообщениеЛога) Экспорт
	
	Возврат Уровень(УровеньЛога).Сообщение(СообщениеЛога);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область Терминальные_операции

Функция ПолучитьОписание() Экспорт

	Возврат Тело;
	
КонецФункции

#КонецОбласти


#Область Вспомогательные_функции

Функция ДатуВTimestamp(пДата = Неопределено)
   Возврат Формат(Число(?(ТипЗнч(пДата) = Тип("Дата"), пДата, ТекущаяДата())-Дата("19700101")),"ЧН=0; ЧГ=0");
КонецФункции

#КонецОбласти